
dao = '''
                   编程之道：
  "大道无形，生育天地；大道无情，运行日月；大道无名，长养万物；吾不知其名，强名曰道。"  编程之道，起于心，行于术，得于道。
  心为万之源，心静万物自然静。"常能遣其欲，而心自静，澄其心而神自清。心静至极"，"泰山崩于前而色不变，麋鹿兴于左而目不瞬，然后可以制利害，可以待敌。"
  为学日益，术业虽有专攻，然更相通。编程之术无异于雕塑、工笔水墨，多一行代码冗余，少一行代码则不足。
  为道日损，"秉之御繁以简，常得无事"。大道至简，以简驭繁。理不简，则道不明！
  “信言不美，美言不信。善者不辩，辩者不善。知者不博，博者不知。圣人不积，既以为人己愈有，既以与人己愈多。天之道，利而不害。人之道，为而不争。”

                                    From: 道法自然 Prof.Li (liluqun@gmail.com)
                                    参考：《道德经》、《太上老君清静经》、《权书·心术》
'''
print(dao)