TOTAL_TILE_NUM = 144
SEATS = [EAST, SOUTH, WEST, NORTH] = range(4)
POSITIONS = [DOWN, RIGHT, UP, LEFT] = range(4)
ACTIONS = [TAKE, DISCARD, CHI, PENG, ANGANG, BUGANG, ZHIGANG, HU, UNKNOWN] = range(9)
WIN_FROM = [FROM_WALL, FROM_DISCARD] = range(2)
DISCARD_TAKEN_TILE_STR = 'z1'
FAN_NAME_ZH = [
    '大四喜', '大三元', '绿一色', '九莲宝灯', '四杠', '连七对', '十三幺',
    '清幺九', '小四喜', '小三元', '字一色', '四暗刻', '一色双龙会',
    '一色四同顺', '一色四节高',
    '一色四步高', '三杠', '混幺九',
    '七对', '七星不靠', '全双刻', '清一色', '一色三同顺', '一色三节高', '全大', '全中', '全小',
    '清龙', '三色双龙会', '一色三步高', '全带五', '三同刻', '三暗刻',
    '全不靠', '组合龙', '大于五', '小于五', '三风刻',
    '花龙', '推不倒', '三色三同顺', '三色三节高', '无番和', '妙手回春', '海底捞月', '杠上开花', '抢杠和', '双暗杠',
    '碰碰和', '混一色', '三色三步高', '五门齐', '全求人', '双箭刻',
    '全带幺', '不求人', '双明杠', '和绝张',
    '箭刻', '圈风刻', '门风刻', '门前清', '平和', '四归一', '双同刻', '双暗刻', '暗杠',
    '断幺', '一般高', '喜相逢', '连六', '老少副', '幺九刻', '明杠', '缺一门', '无字', '边张', '坎张', '单调将', '自摸', '花牌',
    '一明一暗杠',
]
FANZHONG_POINT = [
    88, 88, 88, 88, 88, 88, 88,
    64, 64, 64, 64, 64, 64,
    48, 48,
    32, 32, 32,
    24, 24, 24, 24, 24, 24, 24, 24, 24,
    16, 16, 16, 16, 16, 16,
    12, 12, 12, 12, 12,
    8, 8, 8, 8, 8, 8, 8, 8, 8, 8,
    6, 6, 6, 6, 6, 6,
    4, 4, 4, 4,
    2, 2, 2, 2, 2, 2, 2, 2, 2,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    5,
]
STR_ZH = {
    'HU': '和牌',
    'TOTAL_POINT': '总分',
    'WIN_FROM': ['自摸', '点和'],
    'SEAT': ['东', '南', '西', '北'],
}
