Repository: pypi-data/pypi-mirror-161
Catalog: packages/editpi/editpi-1.1-py3-none-any.whl/editpi/assets/translations/*/LC_MESSAGES/mcpiedit.po
Languages: es_es, pl, ru_ru

source: The default built-in NBT editor for Planet. MCPIedit makes use of Pi-NBT from the original MCPIedit project by TheBrokenRail, which is licensed under the MIT license.
es_es: El editor NBT incorporado por defecto para Planet. MCPIedit hace uso de Pi-NBT del proyecto MCPIedit original de TheBrokenRail, que está licenciado bajo la licencia MIT.
pl: Domyślny wbudowany edytor NBT dla Planet. MCPIedit wykorzystuje Pi-NBT z oryginalnego projektu MCPIedit TheBrokenRail, który jest licencjonowany na licencji MIT.
ru_ru: Встроенный редактор NBT для Planet. MCPIedit использует Pi-NBT из оригинального проекта MCPIedit, который создан TheBrokenRail, лицензирован под лицензией MIT.

source: NBT editors allow you to edit your world files to change game modes, time, and even the world name. Select an NBT file to edit using the button below.
es_es: Los editores NBT te permiten editar los archivos del mundo para cambiar los modos de juego, el tiempo, e incluso el nombre del mundo. Seleccione un archivo NBT para editar usando el botón de abajo.
pl: Edytory NBT pozwalają na edycję plików świata w celu zmiany trybów gry, czasu, a nawet nazwy świata. Wybierz plik NBT do edycji za pomocą przycisku poniżej.
ru_ru: Редакторы NBT позволяют редактировать файлы, чтобы изменить игровые режимы, время, и даже название мира. Выберите файл NBT для редактирования с помощью кнопки ниже.

source: Select NBT File
es_es: Seleccionar archivo NBT
pl: Wybierz plik NBT
ru_ru: Выберите NBT файл

source: About
es_es: Sobre
pl: O programie
ru_ru: О программе

source: General
pl: Ogólne
ru_ru: Общее

source: World
es_es: Mundo
pl: Świat
ru_ru: Мир

source: World name
es_es: Nombre del mundo
pl: Nazwa świata
ru_ru: Название мира

source: OneChunk
es_es: UnoFragmento
pl: Jeden chunk
ru_ru: Еднственный Чанк

source: Last Played Timestamp
es_es: Última jugada
pl: Ostatnio grano Timestamp
ru_ru: Отметка времени последнего открытия мира

source: Game mode
es_es: Modo de juego
pl: Tryb gry
ru_ru: Игровой режим

source: Time (In Ticks)
es_es: Tiempo (en Tics)
pl: Czas (w tickach)
ru_ru: Время (в тиках)

source: Back
es_es: Atrás
pl: Wstecz
ru_ru: Обратно

source: Save
es_es: Guardar
pl: Zapisz
ru_ru: Сохранить

source: Spawnpoint X
es_es: Ubicación de Regenerar X
pl: Punkt odrodzenia X
ru_ru: Координаты Х

source: Spawnpoint Y
es_es: Ubicación de Regenerar Y
pl: Punkt odrodzenia Y
ru_ru: Координаты Y

source: Spawnpoint Z
es_es: Ubicación de Regenerar Z
pl: Punkt odrodzenia Z
ru_ru: Координаты Z

source: Player Spawnpoint X
es_es: Ubicación de Regenerar X del jugador
pl: Punkt odrodzenia gracza X
ru_ru: Точка возрождения игрока X

source: Player Spawnpoint Y
es_es: Ubicación de Regenerar Y del jugador
pl: Punkt odrodzenia gracza Y
ru_ru: Точка возрождения игрока Y

source: Player Spawnpoint Z
es_es: Ubicación de Regenerar Z del jugador
pl: Punkt odrodzenia gracza Z
ru_ru: Точка возрождения игрока Z

source: Note: Player spawnpoints are very buggy! You might spawn in the wrong place or even outside the world! Do not use on valuable worlds.
es_es: Nota: ¡Los puntos de aparición de jugadores son muy erróneos! ¡Puedes aparecer en el lugar incorrecto o incluso fuera del mundo! No utilices en mundos valiosos.
pl: Uwaga: Punkty spawnacji gracza są bardzo problematyczne! Możesz pojawić się w złym miejscu lub nawet poza światem! Nie używaj tego na twoich wartościowych światach.
ru_ru: Примечание: Точки появления игрока очень неточны! Вы можете возродиться в неправильном месте или даже за пределами мира! Не пробуйте это на ценных мирах.

source: Open NBT File
es_es: Abrir archivo NBT
pl: Otwórz plik NBT
ru_ru: Открыть файл NBT

source: Minecraft Pi Level NBT (level.dat)
es_es: Nivel NBT de Minecraft Pi (level.dat)
pl: Poziom Minecraft Pi NBT (level.dat)
ru_ru: Файлы NBT уровня Minecraft Pi (level.dat)

source: MCPIEdit
ru_ru: Редактор MCPIEdit
